## Import libraries

In [1]:
import numpy as np
import pandas as pd

## Get the dataset

In [13]:
# Users dataset
columns = ['user_id', 'item_id', 'rating', 'timestamp']
user_ratings = pd.read_csv("ml-100k/u.data", sep = "\t", names = columns)

In [14]:
user_ratings.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [8]:
# Get the total number of unique users and movies in the dataset
print("Total users in the dataset: ", user_ratings['user_id'].nunique())
print("Total movies in the dataset: ", user_ratings['item_id'].nunique())

Total users in the dataset:  943
Total movies in the dataset:  1682

In [18]:
# Get the movies dataset
columns = ['item_id', 'title']
movie_titles = pd.read_csv("ml-100k/u.item", sep="|", header = None)

movie_titles = movie_titles[[0, 1]] # Subset the first two columns containing title
movie_titles.columns = columns

In [19]:
movie_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [20]:
user_ratings_movies = pd.merge(user_ratings, movie_titles, on = 'item_id')

user_ratings_movies

,user_id,item_id,rating,timestamp,title
0,196,242,3,881250949,Kolya (1996)
1,63,242,3,875747190,Kolya (1996)
2,226,242,5,883888671,Kolya (1996)
3,154,242,3,879138235,Kolya (1996)
4,306,242,5,876503793,Kolya (1996)
...,...,...,...,...,...
99995,840,1674,4,891211682,Mamma Roma (1962)
99996,655,1640,3,888474646,"Eighth Day, The (1996)"
99997,655,1637,3,888984255,Girls Town (1996)
99998,655,1630,3,887428735,"Silence of the Palace, The (Saimt el Qusur) (1..."
99999,655,1641,3,887427810,Dadetown (1995)

## Exploratory Data Analysis

In [21]:
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style('white')

In [31]:
# Get the mean ratings for each of the movies
mean_ratings = user_ratings_movies.groupby('title').mean()['rating'].sort_values(ascending = False)
mean_ratings.head()

title
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Great Day in Harlem, A (1994)                        5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64

In [ ]:
# Now, we'll see how many reviews each movie has got
rating_counts = user_ratings_movies.grou